{
  "metadata": {
    "file_name": "Модуль Приемная комиссия",
    "source_type": "university_documentation",
    "last_updated": "2025-04-04"
  },
  "content": [
    {
      "id": "admission_online_applications",
      "title": "Онлайн-регистрация заявлений",
      "type": "module",
      "description": "Регистрация абитуриентов через онлайн-форму: загрузка документов, выбор направления, присвоение ID.",
      "steps": [
        "Абитуриент заходит на портал и нажимает «Подать заявление».",
        "Заполняет персональные данные, выбирает форму и направление обучения.",
        "Загружает сканы: аттестат, сертификат ЕНТ, фото, удостоверение.",
        "После проверки системой создаётся карточка абитуриента с уникальным ID и статусом «Ожидает подтверждения»."
      ],
      "ui_notes": [
        "Форма поддерживает автозаполнение через ИИН.",
        "Валидация всех обязательных полей и сканов перед подачей."
      ],
      "available_roles": ["абитуриент", "приемная комиссия"]
    },
    {
      "id": "admission_applicant_list",
      "title": "Список абитуриентов",
      "type": "module",
      "description": "Работа приёмной комиссии с заявками: просмотр, фильтрация, обновление данных, печать договоров и извещений.",
      "steps": [
        "Перейдите в раздел «Абитуриенты».",
        "Выберите фильтр: год, направление, статус, ИИН.",
        "Просмотрите данные: ФИО, баллы, документы, статус подачи.",
        "Нажмите на абитуриента, чтобы изменить статус (например, «Рекомендован к зачислению»), напечатать договор или отправить уведомление."
      ],
      "ui_notes": [
        "Можно массово выгрузить списки в Excel по фильтрам.",
        "Поддерживается массовое изменение статуса или распределение по приказам."
      ],
      "available_roles": ["приемная комиссия"]
    },
    {
      "id": "admission_add_applicant",
      "title": "Добавление абитуриента вручную",
      "type": "module",
      "description": "Функция регистрации абитуриента сотрудником комиссии напрямую через админ-панель (в обход онлайн-формы).",
      "steps": [
        "Откройте раздел «Добавить абитуриента».",
        "Введите ФИО, ИИН, контакты, образовательную программу, тип приёма.",
        "Загрузите сканы документов (фото, ЕНТ, аттестат и др.).",
        "Сохраните — заявка попадёт в общий список с пометкой 'ручной ввод'."
      ],
      "validation": [
        "ИИН должен быть уникален.",
        "Нельзя сохранять запись без загруженных основных документов."
      ],
      "ui_notes": [
        "Отмечается, кто из сотрудников внёс запись (ФИО и дата).",
        "Возможна последующая редактируемость только до передачи в приказ."
      ],
      "available_roles": ["приемная комиссия"]
    },
    {
      "id": "admission_enrollment_orders",
      "title": "Формирование приказов о зачислении",
      "type": "module",
      "description": "Создание, редактирование и печать приказов о зачислении. Связь с заявками и контроль статуса зачисленных.",
      "steps": [
        "Перейдите в раздел «Приказы».",
        "Нажмите «Создать приказ».",
        "Выберите список абитуриентов по статусу 'рекомендован'.",
        "Проверьте данные: ФИО, ИИН, направление, грант / платное, форма обучения.",
        "Сформируйте PDF-файл приказа и сохраните его в систему."
      ],
      "validation": [
        "Абитуриенты без полного пакета документов не допускаются.",
        "Нельзя включить одного и того же студента дважды."
      ],
      "ui_notes": [
        "Приказ автоматически меняет статус абитуриента на 'Зачислен'.",
        "Доступна печать, экспорт и версия для подписи ректора."
      ],
      "available_roles": ["приемная комиссия", "ответственный секретарь"]
    },
    {
      "id": "admission_reference_data",
      "title": "Справочники приёмной кампании",
      "type": "module",
      "description": "Редактирование справочников, связанных с поступлением: образовательные программы, категории поступления, типы грантов, награды и др.",
      "steps": [
        "Перейдите в раздел «Справочники».",
        "Выберите нужную категорию: направления, награды, категории поступающих.",
        "Нажмите «Добавить» или «Изменить».",
        "Заполните поля: код, наименование, условия приёма.",
        "Сохраните."
      ],
      "ui_notes": [
        "Изменения вступают в силу сразу и влияют на онлайн-форму подачи заявлений.",
        "Некоторые справочники синхронизированы с базой данных МОН."
      ],
      "available_roles": ["приемная комиссия", "администратор"]
    }
  ]
}
