{
  "metadata": {
    "file_name": "Модуль Бакалавр (расширенный)",
    "source_type": "university_documentation",
    "last_updated": "2025-04-04"
  },
  "content": [
    {
      "id": "bachelor_gpa_improvement",
      "title": "Повышение GPA",
      "type": "module",
      "description": "Функция подачи заявок на повторное обучение с целью повышения GPA, если студент не прошёл по проходному баллу, но выполнил учебную программу.",
      "steps": [
        "Перейдите в раздел «Повышение GPA».",
        "Выберите учебный год и семестр.",
        "Найдите свою фамилию в списке или воспользуйтесь фильтром.",
        "Отметьте дисциплины для пересдачи.",
        "Нажмите «Подать заявку».",
        "Оплатите через банк, следуя реквизитам в сформированном счёте."
      ],
      "status_behavior": [
        {
          "status": "Заявка подана",
          "description": "Заявка зарегистрирована, но оплата не поступила."
        },
        {
          "status": "Оплачено",
          "description": "Заявка активирована. Дисциплина появится в ИУП, доступ к регистрации открыт."
        }
      ],
      "validation": [
        "Подача доступна только студентам, у которых GPA ниже проходного значения, но зачтены все дисциплины.",
        "Проверяется завершённость всех курсов."
      ],
      "available_roles": ["студент"],
      "ui_notes": [
        "Функция активна только в установленные сроки.",
        "После оплаты заявка редактированию не подлежит.",
        "Формируется счёт для оплаты, статус обновляется вручную после подтверждения бухгалтерией."
      ],
      "error_cases": [
        "Если дисциплина уже выбрана ранее — система не даст выбрать повторно.",
        "Если студент не выполнил базовый учебный план — появится сообщение: «Недостаточно пройденных дисциплин»."
      ]
    },
    {
      "id": "bachelor_survey",
      "title": "Анкетирование студентов",
      "type": "module",
      "description": "Анонимное анкетирование для оценки преподавателей по ряду критериев, влияющее на рейтинг ППС.",
      "steps": [
        "Перейдите в раздел «Анкетирование студентов».",
        "Выберите нужную анкету и преподавателя.",
        "Поставьте оценки по каждому пункту от 1 до 5.",
        "Нажмите «Сохранить»."
      ],
      "validation": [
        "Анкету можно заполнить только один раз по каждой дисциплине.",
        "Доступ открывается только в период анкетирования."
      ],
      "available_roles": ["студент"],
      "ui_notes": [
        "Преподаватель не видит, кто его оценивал.",
        "Баллы анкетирования суммируются в общем рейтинге ППС.",
        "Если кнопка недоступна — анкетирование ещё не началось или уже завершено."
      ],
      "error_cases": [
        "При повторной попытке: «Вы уже заполнили анкету по данному преподавателю»."
      ]
    },
    {
      "id": "bachelor_individual_plan",
      "title": "Индивидуальный учебный план (ИУП)",
      "type": "module",
      "description": "Выбор дисциплин и преподавателей для формирования индивидуального учебного плана на семестр.",
      "steps": [
        "Перейдите в раздел «ИУП».",
        "Выберите дисциплины (обязательные и элективные).",
        "Для каждой выберите преподавателя (лекции и семинары отдельно).",
        "Нажмите «Сохранить» ИУП.",
        "Нажмите «Отправить» для утверждения ИУП."
      ],
      "status_behavior": [
        {
          "status": "Черновик",
          "description": "ИУП сохранён, но не утверждён. Можно редактировать."
        },
        {
          "status": "Отправлено на утверждение",
          "description": "Редактирование недоступно. Ожидается подтверждение."
        },
        {
          "status": "Утверждено",
          "description": "План принят. Доступ к изменению закрыт."
        }
      ],
      "validation": [
        "Обязательные дисциплины должны быть выбраны полностью.",
        "Недопустимо выбирать одного и того же преподавателя на семинар и лекцию одновременно, если запрещено регламентом."
      ],
      "ui_notes": [
        "При сохранении отображается уведомление «ИУП успешно сохранён» в верхней части экрана.",
        "Поля с * обязательны к заполнению.",
        "Дисциплины, уже пройденные ранее, отображаются серым цветом и недоступны для выбора."
      ],
      "available_roles": ["студент"]
    },
    {
      "id": "bachelor_attestation",
      "title": "Аттестации (Рубежный контроль)",
      "type": "module",
      "description": "Раздел для просмотра результатов рубежного контроля (РК1 и РК2), отображаемых после внесения преподавателем.",
      "steps": [
        "Перейдите в раздел «Аттестации».",
        "Выберите семестр и дисциплину.",
        "Просмотрите оценки по РК1 и РК2 в соответствующих колонках."
      ],
      "status_behavior": [
        {
          "status": "Оценка недоступна",
          "description": "Преподаватель ещё не сохранил результаты по данной дисциплине."
        },
        {
          "status": "Оценка внесена",
          "description": "Оценка отображается, доступна только для просмотра."
        }
      ],
      "validation": [
        "Доступ к аттестациям открыт только после их сохранения преподавателем."
      ],
      "ui_notes": [
        "Оценки РК появляются автоматически после сохранения ведомости.",
        "Поля нередактируемые, доступны только для просмотра."
      ],
      "available_roles": ["студент"]
    }
    ,
    {
      "id": "bachelor_transcript",
      "title": "Транскрипт",
      "type": "module",
      "description": "Личный академический транскрипт с перечнем дисциплин, оценок, кредитов и итогового GPA.",
      "steps": [
        "Перейдите в раздел «Транскрипт».",
        "Выберите курс или семестр из выпадающего списка.",
        "Просмотрите таблицу с данными: дисциплина, оценка, кредиты, баллы, GPA."
      ],
      "ui_notes": [
        "Информация отображается в виде таблицы и доступна только для просмотра.",
        "Транскрипт можно сохранить в PDF или распечатать.",
        "Если студент обучается на нескольких образовательных программах, отображается вкладка по каждой."
      ],
      "available_roles": ["студент"]
    },
    {
      "id": "bachelor_coursework",
      "title": "Курсовая работа",
      "type": "module",
      "description": "Раздел для загрузки курсовой работы, ввода темы, научного руководителя и контроля статуса проверки.",
      "steps": [
        "Перейдите в «Курсовая работа».",
        "Выберите дисциплину и семестр.",
        "Заполните тему работы и ФИО научного руководителя.",
        "Загрузите файл в формате DOC, DOCX или PDF.",
        "Нажмите «Сохранить»."
      ],
      "status_behavior": [
        {
          "status": "Не проверено",
          "description": "Работа загружена, ожидает проверки преподавателем."
        },
        {
          "status": "Проверено",
          "description": "Работа просмотрена и принята преподавателем."
        }
      ],
      "validation": [
        "Проверяется наличие заголовка, прикреплённого файла и ФИО научрука.",
        "Файл должен быть в допустимом формате и не превышать лимит размера (например, 10 МБ)."
      ],
      "ui_notes": [
        "Можно загрузить только один файл — при повторной загрузке предыдущий будет заменён.",
        "После проверки поля становятся недоступными для редактирования."
      ],
      "available_roles": ["студент"]
    },
    {
      "id": "bachelor_academic_debts",
      "title": "Задолженности",
      "type": "module",
      "description": "Раздел позволяет студенту просматривать академические задолженности и оформлять заявки на пересдачу.",
      "steps": [
        "Перейдите в раздел «Задолженности».",
        "Выберите текущий семестр или используйте фильтр по дисциплине.",
        "Нажмите «Оформить пересдачу» рядом с нужной дисциплиной.",
        "Подтвердите заявку на пересдачу."
      ],
      "status_behavior": [
        {
          "status": "Заявка создана",
          "description": "Ожидает подтверждения и назначения даты пересдачи."
        },
        {
          "status": "Пересдача проведена",
          "description": "Результаты доступны в модуле «Аттестации» или «ИУП»."
        }
      ],
      "validation": [
        "Пересдача доступна только по дисциплинам с итоговой оценкой ниже проходного уровня.",
        "Нельзя оформить повторную заявку по уже пересданной дисциплине."
      ],
      "ui_notes": [
        "Функция доступна только в установленные сроки, определённые учебной частью.",
        "После оформления кнопка пересдачи становится недоступной для изменения."
      ],
      "available_roles": ["студент"]
    },
    {
      "id": "bachelor_graduation_thesis",
      "title": "Диплом и защита (ГВР)",
      "type": "module",
      "description": "Раздел предназначен для финального этапа подготовки к защите дипломной работы, включая прикрепление итогового файла и подтверждение научным руководителем.",
      "steps": [
        "Откройте вкладку «ГВР» (Государственная выпускная работа).",
        "Заполните тему, научного руководителя и аннотацию.",
        "Загрузите финальный вариант дипломной работы.",
        "Нажмите «Отправить на проверку»."
      ],
      "status_behavior": [
        {
          "status": "Отправлено",
          "description": "Работа передана научному руководителю на проверку."
        },
        {
          "status": "Принято",
          "description": "Работа одобрена и допущена к защите."
        }
      ],
      "validation": [
        "Файл должен быть загружен в формате PDF и содержать необходимые метаданные.",
        "Поля «Тема», «Руководитель» и «Файл» обязательны."
      ],
      "ui_notes": [
        "После отправки редактирование невозможно.",
        "Подтверждение руководителем отображается на панели состояния."
      ],
      "available_roles": ["студент"]
    },
    {
      "id": "bachelor_edit_personal_data",
      "title": "Редактирование личных данных",
      "type": "module",
      "description": "Раздел позволяет студенту редактировать персональные данные, включая контакты, фото и место проживания.",
      "steps": [
        "Откройте раздел «Личные данные».",
        "Нажмите «Редактировать».",
        "Обновите e-mail, адрес, телефон, загрузите фото (необязательно).",
        "Нажмите «Сохранить»."
      ],
      "validation": [
        "E-mail должен быть в корректном формате.",
        "Фото загружается в формате JPEG/PNG размером до 5 МБ."
      ],
      "ui_notes": [
        "Если изменения не сохраняются — проверьте корректность заполнения обязательных полей.",
        "После сохранения данные отображаются на главной странице профиля."
      ],
      "available_roles": ["студент"]
    }
    ,
    {
      "id": "bachelor_document_requests",
      "title": "Запросы на документы",
      "type": "module",
      "description": "Раздел позволяет студенту оформить заявку на получение различных официальных документов: справки, характеристики, академическая справка и др.",
      "steps": [
        "Перейдите в раздел «Запросы на документы».",
        "Выберите тип документа из выпадающего списка (например, справка об обучении, академическая справка).",
        "Заполните причину получения (если требуется).",
        "Укажите, в каком формате нужен документ: PDF, бумажный.",
        "Нажмите «Отправить заявку»."
      ],
      "status_behavior": [
        {
          "status": "Принято",
          "description": "Заявка поступила в учебный офис и ожидает обработки."
        },
        {
          "status": "Готово",
          "description": "Документ сформирован и доступен для скачивания или получения в офисе."
        }
      ],
      "validation": [
        "Некоторые типы документов требуют заполнения причины запроса.",
        "Нельзя подать повторную заявку на тот же документ, пока не завершена предыдущая."
      ],
      "ui_notes": [
        "После обработки появляется кнопка «Скачать документ».",
        "Уведомление о готовности отправляется во внутренней системе сообщений."
      ],
      "available_roles": ["студент"]
    },
    {
      "id": "bachelor_student_appeals",
      "title": "Обращения студентов",
      "type": "module",
      "description": "Форма для подачи письменных обращений в учебный офис, деканат или другие административные службы.",
      "steps": [
        "Откройте раздел «Обращения студентов».",
        "Выберите категорию обращения: учебный процесс, дисциплина, преподаватель, и т.д.",
        "Опишите ситуацию или задайте вопрос.",
        "Прикрепите файл, если требуется (скриншот, заявление).",
        "Нажмите «Отправить»."
      ],
      "status_behavior": [
        {
          "status": "На рассмотрении",
          "description": "Обращение зарегистрировано, ожидает ответа от ответственного отдела."
        },
        {
          "status": "Закрыто",
          "description": "Обращение обработано, студенту направлен ответ."
        }
      ],
      "validation": [
        "Описание обращения не должно быть пустым.",
        "Прикреплённый файл не должен превышать 10 МБ."
      ],
      "ui_notes": [
        "Ответы отображаются в том же окне, где отправлено обращение.",
        "Можно просматривать историю ранее отправленных обращений."
      ],
      "available_roles": ["студент"]
    },
    {
      "id": "bachelor_exam_schedule",
      "title": "Расписание экзаменов",
      "type": "module",
      "description": "Интерфейс для просмотра официального расписания итогового контроля по выбранному семестру.",
      "steps": [
        "Откройте раздел «Расписание экзаменов».",
        "Выберите семестр (осенний или весенний).",
        "Выберите свою образовательную программу (если отображается несколько).",
        "Просмотрите список экзаменов, дат, аудиторий и преподавателей."
      ],
      "ui_notes": [
        "Если расписание ещё не опубликовано — появляется сообщение: «Расписание в процессе формирования».",
        "После утверждения расписание становится доступно для печати или сохранения."
      ],
      "available_roles": ["студент"]
    },
	{
	  "id": "bachelor_course_registration",
	  "title": "Регистрация на дисциплины (осенний и весенний семестр)",
	  "type": "module",
	  "description": "Функция позволяет студентам выбрать дисциплины и преподавателей на новый семестр. Регистрация проводится отдельно для осеннего и весеннего семестров.",
	  "steps": [
		"Перейдите в раздел «Регистрация на дисциплины».",
		"Выберите нужный семестр (осенний или весенний).",
		"Откроется список обязательных дисциплин и блок элективов.",
		"Отметьте дисциплины, которые хотите изучать (по умолчанию обязательные уже выбраны).",
		"Выберите преподавателя отдельно для лекционных и семинарских занятий (если требуется).",
		"Нажмите кнопку «Сохранить».",
		"При необходимости — нажмите «Отправить на утверждение»."
	  ],
	  "status_behavior": [
		{
		  "status": "Черновик",
		  "description": "Регистрация сохранена, но ещё не отправлена на утверждение. Можно редактировать."
		},
		{
		  "status": "Отправлено",
		  "description": "Данные переданы в учебный офис. Редактирование временно недоступно."
		},
		{
		  "status": "Утверждено",
		  "description": "Регистрация принята, доступ к редактированию закрыт."
		}
	  ],
	  "validation": [
		"Обязательные дисциплины должны быть выбраны обязательно.",
		"Система проверяет пересечения по времени у выбранных дисциплин и преподавателей.",
		"Нельзя отправить на утверждение пустой или неполный ИУП."
	  ],
	  "ui_notes": [
		"Для каждой дисциплины можно открыть подробности (описание, краткий силлабус, кредиты).",
		"При выборе преподавателя отображается его ФИО и должность.",
		"Если доступ к регистрации закрыт — появляется сообщение «Регистрация ещё не началась или уже завершена»."
	  ],
	  "available_roles": ["студент"],
	  "error_cases": [
		"Попытка выбора дисциплины вне своей образовательной программы.",
		"Ошибка: «Вы не выбрали преподавателя для всех компонент дисциплины».",
		"Если дисциплина уже изучалась — появляется предупреждение."
	  ]
	},
	{
	  "id": "bachelor_final_grade_sheet",
	  "title": "Итоговая ведомость (итоговый контроль)",
	  "type": "module",
	  "description": "Раздел предназначен для просмотра итоговых результатов по дисциплинам за выбранный семестр. Отображаются итоговые оценки, допуски, формулы расчёта.",
	  "steps": [
		"Откройте раздел «Итоговая ведомость» или «Итоговый контроль».",
		"Выберите семестр или учебный год.",
		"Откроется таблица с перечнем дисциплин, преподавателей, компонентов контроля и итоговой оценкой.",
		"При необходимости нажмите «Печать» для генерации документа в PDF."
	  ],
	  "status_behavior": [
		{
		  "status": "Ведомость не закрыта",
		  "description": "Оценки ещё могут редактироваться преподавателем. Студент видит текущие данные с пометкой «Предварительно»."
		},
		{
		  "status": "Ведомость закрыта",
		  "description": "Оценки утверждены и зафиксированы. Доступен экспорт в транскрипт."
		}
	  ],
	  "validation": [
		"Система отображает только те дисциплины, по которым студент зарегистрирован в выбранном семестре.",
		"Если нет доступа — появляется сообщение: «Ведомость ещё не сформирована»."
	  ],
	  "ui_notes": [
		"Формула итоговой оценки доступна при наведении курсора на результат (например: РК1×0.3 + РК2×0.3 + экзамен×0.4).",
		"Для пересдач и задолженностей отображаются специальные пометки.",
		"Если есть апелляция — появляется значок уведомления рядом с дисциплиной."
	  ],
	  "available_roles": ["студент"],
	  "error_cases": [
		"Ошибка доступа, если студент пытается просмотреть ведомость за другой уровень образования.",
		"Нет ведомости — пустая таблица с сообщением: «Нет данных по выбранному периоду»."
	  ]
	},
	{
	  "id": "bachelor_appeal_submission",
	  "title": "Подача апелляции",
	  "type": "module",
	  "description": "Модуль предназначен для подачи студентами апелляций на итоговые оценки или результаты экзаменов. Апелляция рассматривается комиссией, и студент получает ответ через систему уведомлений.",
	  "steps": [
		"Перейдите в раздел «Подача апелляции».",
		"Выберите дисциплину, по которой хотите подать апелляцию.",
		"Заполните форму апелляции, указав причину (например, ошибка в подсчёте баллов, спорная оценка).",
		"При необходимости прикрепите подтверждающие документы (сканы, выписки).",
		"Нажмите кнопку «Отправить апелляцию».",
		"Дождитесь подтверждения о регистрации обращения."
	  ],
	  "status_behavior": [
		{
		  "status": "На рассмотрении",
		  "description": "Апелляция зарегистрирована и передана на рассмотрение комиссией."
		},
		{
		  "status": "Рассмотрено – удовлетворено",
		  "description": "Апелляция удовлетворена, оценка пересмотрена."
		},
		{
		  "status": "Рассмотрено – отклонено",
		  "description": "Апелляция отклонена, первоначальная оценка остается в силе."
		}
	  ],
	  "validation": [
		"Поле с причиной апелляции обязательно к заполнению.",
		"Прикрепленные файлы должны быть в допустимом формате (PDF, JPEG, PNG) и не превышать 5 МБ.",
		"Подача апелляции возможна только в установленные сроки после объявления результатов экзамена."
	  ],
	  "ui_notes": [
		"После отправки появляется уведомление «Апелляция отправлена».",
		"Статус апелляции можно отслеживать в личном кабинете.",
		"Если апелляция уже была подана по данной дисциплине, повторная отправка недоступна."
	  ],
	  "available_roles": ["студент"],
	  "error_cases": [
		"Если поле причины пустое — выводится сообщение «Введите причину апелляции».",
		"Если прикрепленный файл превышает лимит по размеру — появляется предупреждение «Файл слишком большой».",
		"Если срок подачи апелляции истёк — выводится сообщение «Период подачи апелляций завершён»."
	  ]
	},
	{
	  "id": "bachelor_academic_leave_or_reinstatement",
	  "title": "Заявка на академический отпуск / восстановление",
	  "type": "module",
	  "description": "Раздел предназначен для подачи заявлений на академический отпуск по уважительным причинам (болезнь, призыв, семейные обстоятельства) или восстановление в число обучающихся после ранее оформленного академотпуска.",
	  "steps": [
		"Перейдите в раздел «Заявления студентов».",
		"Нажмите «Подать заявление».",
		"Выберите тип: «Академический отпуск» или «Восстановление».",
		"Укажите причину обращения (для академотпуска) или номер приказа (для восстановления, если известен).",
		"Прикрепите подтверждающий документ (например, справка 095/у, военный билет, заявление и пр.).",
		"Нажмите кнопку «Отправить»."
	  ],
	  "status_behavior": [
		{
		  "status": "На рассмотрении",
		  "description": "Заявка направлена в деканат / учебный отдел и ожидает принятия решения."
		},
		{
		  "status": "Одобрено",
		  "description": "Заявка утверждена. В случае академотпуска — будут приостановлены регистрация и расчёт GPA."
		},
		{
		  "status": "Отклонено",
		  "description": "Заявка отклонена. Причина отказа отображается в комментарии."
		}
	  ],
	  "validation": [
		"Для академического отпуска обязательно прикрепить медицинский документ или подтверждение из компетентного органа.",
		"Сроки подачи регламентируются внутренним календарём университета.",
		"Восстановление доступно только при наличии приказа на академотпуск и отсутствии отчисления."
	  ],
	  "ui_notes": [
		"После отправки появится уведомление «Заявление принято. Ожидайте ответа».",
		"История всех поданных заявлений доступна во вкладке «Мои обращения».",
		"Окончательное решение направляется студенту через модуль уведомлений."
	  ],
	  "available_roles": ["студент"],
	  "error_cases": [
		"Если не прикреплён файл — система выдаёт сообщение: «Необходимо приложить документ».",
		"Если студент уже находится в академотпуске — появляется запрет на повторную подачу.",
		"Если выбран неверный тип — появляется предупреждение «Тип заявления не соответствует вашему статусу»."
	  ]
	}
  ]
}
