{
  "metadata": {
    "file_name": "Модуль Бакалавр",
    "section_title": "Модуль Бакалавр",
    "source_type": "university_documentation",
    "last_updated": "2025-05-12",
    "language": "ru",
    "document_version": "1.0",
    "doc_id": "module_bakalavr",
    "tags": [
      "бакалавриат",
      "оценки",
      "регистрация",
      "ИУП",
      "дисциплины",
      "FX",
      "GPA"
    ],
    "audience": "students",
    "restricted": false
  },
  "section": "Модуль Бакалавр",
  "description": "Модуль предоставляет студентам доступ к данным об обучении, заявкам, оценкам, ИУП и другим функциям личного кабинета.",
  "roles": [
    "студент",
    "куратор",
    "академический персонал"
  ],
  "functions": [
    {
      "name": "ВОУД",
      "description": "– функция предназначена для прохождения тестирования на ВОУД.\nзадолжности – функция предназначена для повторного обучения по дисциплинам на платной основе;\nУМКД\nмой эдвайзер\nдистанционные курсы – функция предназначена для студентов находящихся в заграничной командировке, для прохождения курса дистанционно.",
      "links": [],
      "keywords": [],
      "steps": []
    },
    {
      "name": "Задолженности",
      "description": "- Повторное обучение с целью ликвидации академической задолженности. Обучающиеся регистрируются на повторное обучение, при наличии академической задолженности, дисциплин с оценкой «неудовлетворительно» по итогам итогового контроля (экзаменационных сессий);  при наличии дисциплин академической разницы при переводе из других ОВПО или с других ОП, при восстановлении в контингент обучающихся после отчисления, длительной заграничной командировки или академического отпуска;\n\nФункция Задолжности позволяет студенту подать заявку на повторное обучение на платной основе.\nДля подачи заявки необходимо выполнить следующие действия:\nвыбрать функцию Задолжности. В открывшемся окне выходит список задолженностей студента;\nвыбрать дисциплины для повторного изучения, отметив их галочкой;\nнажать кнопку Отправить заявку на повторное обучение .\nЕсли где Стоимость обучения за год составляет: нету суммы, то у студента не выйдет окошка для выбора дисциплины, в этом случае студен должен  обратиться к специалистам деканата.\nПоданная заявка отправляется на рассмотрение методисту. Методист оформляет договор и студент оплачивает через банк. Если студент не оплатил или передумал, то методист аннулирует заявку студента. Статус заявки можно посмотреть в поле   Мои заявки на повторное обучение .\nУМКД\nС помощью функции УМКД студент может получить нужный учебный материал  по дисциплинам. УМКД  загружается преподавателем и хранится в папках, в формате .pdf. Студент может просмотреть материал на экране или сохранить его на диске. Для просмотра УМКД необходимо выполнить следующие действия:\nоткрыть папку с названием дисциплины . На экране появится список загруженных файлов ;\nдважды щелкнуть на файл. Откроется диалоговое окно, в котором можно выбрать одну из предложенных команд: Открыть или Сохранить как.\nМой эдвайзер\nС помощью функции Мой эдвайзер студенты могут увидеть информацию о своем эдвайзере .\n - Данные об эдвайзере\nДистанционные курсы\nДистанционные курсы – функция предназначена для студентов находящихся в заграничной командировке, для изучения дисциплины дистанционно.\nДля выполнения задания преподавателя, необходимо выполнить следующие действия:\nвыбрать во вкладке Бакалавр функцию Дистанционные курсы. На экране появится список дисциплин\nвыбрать дисциплину, дважды щелкнув на ней мышью. Появится список специальностей ;\nоткрыть специальность двумя щелчками мыши. На экране появится список периодов по неделям. В колонке Количество заданий можно увидеть, загружены задания преподавателем на текущую неделю или нет;\nвыделить неделю и активизировать команду Задания (или дважды щелкнуть на неделе мышью). На экране появится список заданий ;\nвыделить задание и нажать на кнопку Просмотр\nввести текст в текстовое поле, прикрепить файл с помощью ссылки Добавить и нажать на кнопку Отправить сообщение .\n– новое сообщение\nОбратите внимание на формат ответа, максимальное количество ответов в задании. Данные параметры задает преподаватель. Если формат сообщения установлен, как ответ в виде текста с прикреплением файла , то студент должен ввести сообщение в текстовое поле и нажать на ссылку Добавить для загрузки файла.\nЕсли максимальное количество ответов в задании – 2, то третий ответ отправить преподавателю будет невозможно!\nПросмотреть оценку за задание.\nДля того, чтобы увидеть оценку, проставленную преподавателем за выполнение задания, необходимо выделить задание и активизировать команду Сводный список. На экране появится список группы  и оценка за задание.\nСтудент может скачать дополнительный материал, загруженный преподавателем. В списке периодов, в колонке Количество ресурсов содержится информация о том, сколько файлов загружено.\nДля использования дополнительного материала, необходимо выполнить следующие действия:\nоткрыть период с заданиями. В нижней части окна появится список ресурсов .\nдважды щелкнув на название файла для того, чтобы его скачать.\n\n\n\nэто - повторное обучение дисциплины с целью ликвидации академической задолженности. На повторное обучение заявку могуть подать студенты, имеющие неудовлетворительные оценки по дисциплинам  и студенты обучающиеся на договорной основе для сдачи разницы при переводе из других ВУЗов или с других ОП, при восстановлении в контингент обучающихся после отчисления, длительной заграничной командировки или академического отпуска. Заявка подается через систему Univer, фунционал Задолженности .\n – функционал Задолженности\nДля формирования заявки на повторное обучение, зайдите на сайт ИС Univer. Выберите ссылку Задолжности во вкладке Бакалавр. На экране появится список задолжностей. Столбец «кред» и «Стоимость» должны быть заполнены. Если нет возможности отметить дисциплину, обратитесь к методисту своего факультета. Отметьте галочками те дисциплины, которые нужно включить в заявку. Общая стоимость обучения рассчитается автоматически. Нажмите на кнопку Отправить заявку на повторное изучение .\n – Подача заявки на повторное обучение\nВ поле Мои заявки на повторное обучение,  можно увидеть список поданых заявок и статус заявки. После оформления договора методистом, студент должен оплатить договор через банк. Статус заявки поменяется на оплачено .",
      "links": [],
      "keywords": [
        "заявка",
        "оценки"
      ],
      "steps": []
    },
    {
      "name": "Пересдача FX",
      "description": "- функция предназначена для подачи заявки на дисциплины по которым успеваемость FX;\nПовышение GPA - функция предназначена для подачи заявки, обучающемуся, выполнившему программу курса в полном объеме, но не набравшему минимальный переводной балл, с целью повышения GPA.\nМодуль Е-услуги - Процесс подачи заявки на предоставление электронной услуги подразумевает заполнение студентом электронного заявления на получение услуги. Электронная версия заявления проходит через стадии подачи заявления, проверки, согласования и утверждения. Электронная услуга предполагает участие студента лишь на этапе подачи заявки, что требует дополнительно уведомления студента о состоянии поданной им заявки.\nРегистрация на осенний семестр\nФункция Регистрация на осенний семестр позволяет студенту выбрать элективные дисциплины, которые будут им изучаться в осеннем семестре. Из предложенного списка дисциплин студент выбирает необходимые дисциплины, отмечая их галочкой, а также выбирает преподавателя по дисциплине отдельно на лекционные и семинарские занятия. . Для сохранения результата нужно выбрать команду Сохранить.\n - Выбор элективных дисциплин\nРегистрация на весенний семестр\nСм. выше Регистрация на осенний семестр.\nАнкетирование студентов\nПорядок анкетирования:\nстудент выбирает анкету из предложенного списка ;\nна экране появляется список преподавателей ;\nстудент выбирает преподавателя, по которому будет заполнять анкету;\nна экране появится список вопросов и 5-балльная шкала ответов ;\n - Вопросы анкетирования\nстудент проставляет балл по каждому вопросу и после окончания анкетирования активизирует команду Сохранить.\nАнкетирование проводится анонимно.\n\nВ случае получения за экзамен оценки FХ, студент может на платной основе пересдать экзамен после окончания сессии. Для пересдачи оценки FХ – обучающийся подает заявку со своей страницы в системе Univer, функциянал  Пересдача FX .\n – Подача заявки на пересдачу\nНажмите на фунционал Пересдача FX, в открывшемся окне из списка выберите дисциплину и нажмите на кнопку подать заявку. После оплаты суммы 7000 тенге через банк, статус заявки поменяется на Оплачено  .\n – Оплаченная заявка на пересдачу\nПовышение GPA\nФункция  Повышение GPA предназначена для подачи заявки, обучающемуся, выполнившему программу курса в полном объеме, но не набравшему минимальный переводной балл, с целью повышения GPA .\n – функционал Повышение GPA\nНажмите на фунционал  Повышение GPA, в открывшемся окне из списка выберите нужный семестр,  отметьте галочками те дисциплины, которые нужно включить в заявку  и нажмите на кнопку подать заявку .\n – Подача заявки на Повышение GPA\nВ поле Мои заявки на повышение GPA,  можно увидеть список поданых заявок и статус заявки. После оформления договора методистом, студент должен оплатить договор через банк. Статус заявки поменяется на оплачено .\n – заявки на Повышение GPA",
      "links": [],
      "keywords": [
        "gpa",
        "оценки",
        "заявка",
        "пересдача",
        "регистрация",
        "fx"
      ],
      "steps": []
    },
    {
      "name": "Редактирование личных данных",
      "description": "Функция Редактирование личных данных дает возможность студенту заполнить и отредактировать поля: e\n - Личные данные студента\nАкадемический календарь\nАкадемический календарь информирует студентов о датах экзаменов, периодах рубежных контролей, каникулах и т.д. .\n - Академический календарь",
      "links": [],
      "keywords": [],
      "steps": []
    },
    {
      "name": "Расписание",
      "description": "(экзаменов)\nФункция Расписание экзаменов позволяет получить студентам информацию о расписании своих занятий. Для перехода на расписание следующего семестра нужно выбрать Расписание на (осенний или весенний семестр) .\n – Расписание экзаменов\nУчебный план\nДанная процедура позволяет студентам просмотреть список введенных офис регистратором дисциплин по семестрам, а также информацию о кредитах по дисциплинам, о видах контроля .\n – Учебный план\nТекущая аттестация\nФункция Текущая аттестация дает возможность студенту просмотреть результаты своей успеваемости в семестре, количество кредитов по дисциплинам, количество освоенных кредитов за семестр .\n - Текущая аттестация\nЖурнал посещений и успеваемости\nФункция Журнал посещений и успеваемости позволяет студенту просматривать журнал посещений и успеваемости, который заполняется преподавателем .\n - Журнал посещений и успеваемости\nНа странице студента при изменении баллов в журнале или в ведомости выходит сообщения:\nПри изменении в журнале: Внимание! Обновлены или добавлены баллы в журнале посещаемости и успеваемости.\nПри изменении в ведомости: Внимание! Обновлены или добавлены оценки в аттестации.\nКак только студент откроет журнал или аттестацию сообщения исчезают.\nФайлы эдвайзера\nФункция предназначена для просмотра файлов эдвайзера. Эдвайзер загружает данные файлы, как УМКД, только без привязки к дисциплине. Эти файлы могут видеть только его студенты.\nИндивидуальный учебный план\nИндивидуальный учебный план  позволяет студенту просматривать индивидуальный учебный план  по семестрам. Индивидуальный учебный план состоит из общих дисциплин, которые изучаются всеми студентами, согласно учебному плану, и   элективных дисциплин, которые выбираются каждым студентом индивидуально. Как мы видим на рисунке, ИУП содержит не только список дисциплин, но также информацию о количестве кредитов, список преподавателей по каждой дисциплине и вид контроля. В начале семестра офис регистраторы открывают доступ студентам для согласования ИУП. У студентов кнопка Индивидуальный учебный план выделяется красным цветом .\n - Индивидуальный учебный план студента\nВ ИУПе появляется кнопка Отправить на согласование. Студент нажимает на эту кнопку и ИУП согласовывается студентом и по маршруту отправляется к куратору эдвайзеру далее офису регистратору факультета студента .\n – Отправить ИУП не согласование\nПосле согласования  ИУПа студентом, офис регистратором и куратором выходит отметка Согласовано .  В конце ИУП студента согласовывает декан факультета, В ИУПе появляется слово Утверждено и ФИО декана ., планисунке, план содержитбщих дисциплин, которые изучаются всеми студентами, согласно учебному плану, и\n – согласованный ИУП\n – Утвержденный  ИУП деканом\nТранскрипт\nФункция Транскрипт дает возможность просмотра успеваемости студента за все предыдущие семестры, с учетом текущего семестра . Студент может выбрать на экране язык просмотра транскрипта, а также распечатать транскрипт.\n – Транскрипт",
      "links": [],
      "keywords": [
        "оценки",
        "расписание"
      ],
      "steps": []
    },
    {
      "name": "Анкета",
      "description": "студента\nФункция Анкета студента позволяет просмотреть студенту личную информацию, которая включает в себя сведения о месте обучения, приказы, контактные данные .\nЗагрузка выпускных работ.\nВнимание! Название загружаемого файла не должно быть длинным, иначе документ загрузить не получится.\nДля загрузки дипломной работы выполните следующие действия:\nвыберите во вкладке Магистрант (Бакалавр) функцию Загрузка выпускных работ ;\n – Вкладка «Магистрант».\nна экране появится папки  Дипломная /  Реферат .10.15) и информация о количестве загруженных и подтвержденных файлов;\nдважды щелкните на папку для открытия;\nактивизируйте команду Загрузить ;\n – Загрузка файла.\nнажмите на кнопку Обзор и найдите  папку, в которой находится файл дипломной работы ;\nвыберите язык, на котором выполнена дипломная работа и нажмите на кнопку Загрузить.\nДля того, чтобы изменить название дипломной работы или язык работы, нажмите на ссылку Редактировать .\nДля просмотра текста дипломной работы, дважды щелкните на название файла. После загрузки файла выйдет отчет, его можно открыть кнопкой Посмотреть.\nДля отправки работы на проверку руководителю, нажмите на ссылку Отправить на проверку. В столбце Отправлено руководителю появится знак\nЗнак «минус» в столбце Добавлен в базу означает, что руководитель еще не подтвердил дипломную работу. После подтверждения работы руководителем вместо «минуса» появится «плюс» и тогда изменить или отредактировать дипломную работу будет невозможно. После добавления дипломной работы в базу руководителем в отчете появиться QR  код. Если дипломная работа не будет добавлена в базу, то студент не попадет в ведомость по дипломной работе .\n – Файлы дипломной работы добавлен в базу.",
      "links": [],
      "keywords": [
        "работа",
        "анкета"
      ],
      "steps": [
        "5) и информация о количестве загруженных и подтвержденных файлов;"
      ]
    }
  ]
}