{
  "metadata": {
    "file_name": "Модуль Бухгалтерия и Договоры ДДПУ",
    "section_title": "Модуль Бухгалтерия и Договоры ДДППУ",
    "source_type": "university_documentation",
    "last_updated": "2025-05-20",
    "language": "ru",
    "document_version": "1.6.1",
    "doc_id": "module_buh_ddpu",
    "tags": [
      "бухгалтерия",
      "договора",
      "оплаты",
      "платные услуги",
      "заявки",
      "ДППУ"
    ],
    "audience": "staff_only",
    "restricted": true
  },
  "section": "Модуль Бухгалтерия и Договоры ДДПУ",
  "description": "Модуль предназначен для учета и обработки договоров, заявок на оплату, а также формирования и контроля финансовых операций в рамках ДППУ.",
  "roles": [
    "бухгалтер",
    "методист",
    "руководитель подразделения"
  ],
  "functions": [
    {
      "name": "Поиск студентов",
      "summary": "Поиск студентов Для активизации поиска по студентам, необходимо выбрать ограничения из предложенного списка и активизировать команду Найти студента...",
      "description": "Поиск студентов\nДля активизации поиска по студентам, необходимо выбрать ограничения из предложенного списка и активизировать команду Найти студента . На экране появится список студентов, соответствующих заданным ограничениям.\nЕсли два раза нажать  выбранному студенту, то можно посмотреть его карточку .",
      "steps": [],
      "keywords": [
        "поиск"
      ],
      "links": [],
      "related_functions": []
    },
    {
      "name": "Стоимость обучения",
      "summary": "Стоимость обучения Нажмите на функционал Стоимость обучения, в открывшемся окне для просмотра или добавления стоимость обучения  нужно выполнить следующие действия: выбрать факультет/год начала...",
      "description": "Стоимость обучения\nНажмите на функционал Стоимость обучения, в открывшемся окне для просмотра или добавления стоимость обучения  нужно выполнить следующие действия:\nвыбрать факультет/год начала обучения\nв открывшемся окне заполнить стоимость обучения за год по соответстующим названиям столбцов.\nвыбрать команду Сохранить.",
      "steps": [
        "Нажмите на функционал стоимость обучения, в открывшемся окне для просмотра или добавления стоимость обучения  нужно выполнить следующие действия:"
      ],
      "keywords": [
        "стоимость"
      ],
      "links": [],
      "related_functions": []
    },
    {
      "name": "Кредиты",
      "summary": "Кредиты Нажмите на функционал Кредиты, в открывшемся окне для просмотра или добавления кредита  нужно выполнить следующие действия: выбрать факультет/год начала обучения в открывшемся окне заполнить...",
      "description": "Кредиты\nНажмите на функционал Кредиты, в открывшемся окне для просмотра или добавления кредита  нужно выполнить следующие действия:\nвыбрать факультет/год начала обучения\nв открывшемся окне заполнить кредиты по курсам;\nвыбрать команду Сохранить.\nПовторное обучениие.\nДля просмотра заявки от студента на повторное обучение необходимо выполнить следующие действия:\nвыбрать меню",
      "steps": [
        "Нажмите на функционал кредиты, в открывшемся окне для просмотра или добавления кредита  нужно выполнить следующие действия:"
      ],
      "keywords": [
        "повторное"
      ],
      "links": [],
      "related_functions": [
        "Повторное обучение"
      ]
    },
    {
      "name": "Повторное обучение",
      "summary": "Повторное обучение; в открывшемся окне выбрать год/семестр, факультет или ввести фамилию нужного студента появится список студентов, подавших заявки на повторное обучение...",
      "description": "Повторное обучение;\nв открывшемся окне выбрать год/семестр, факультет или ввести фамилию нужного студента\nпоявится список студентов, подавших заявки на повторное обучение ;",
      "steps": [
        "Появится список студентов, подавших заявки на повторное обучение ;"
      ],
      "keywords": [
        "повторное"
      ],
      "links": [],
      "related_functions": []
    },
    {
      "name": "Пересдача FX",
      "summary": "Для просмотра заявки от студента на пересдачу FX необходимо выполнить следующие действия: выбрать меню Пересдача FX; в открывшемся окне выбрать год/семестр, факультет или ввести фамилию нужного...",
      "description": "Пересдача FX.\nДля просмотра заявки от студента на пересдачу FX необходимо выполнить следующие действия:\nвыбрать меню Пересдача FX;\nв открывшемся окне выбрать год/семестр, факультет или ввести фамилию нужного студента\nпоявится список студентов, подавших заявки на пересдачу FX ;",
      "steps": [
        "Появится список студентов, подавших заявки на пересдачу fx ;"
      ],
      "keywords": [
        "пересдача"
      ],
      "links": [],
      "related_functions": []
    },
    {
      "name": "Повышение GPA",
      "summary": "Повышение GPA Для просмотра заявки от студента на Повышение GPA  необходимо выполнить следующие действия: выбрать меню Повышение GPA; в открывшемся окне выбрать год/семестр, факультет или ввести...",
      "description": "Повышение GPA\nДля просмотра заявки от студента на Повышение GPA  необходимо выполнить следующие действия:\nвыбрать меню Повышение GPA;\nв открывшемся окне выбрать год/семестр, факультет или ввести фамилию нужного студента\nпоявится список студентов, подавших заявки на Повышение GPA ;",
      "steps": [
        "Появится список студентов, подавших заявки на повышение gpa ;"
      ],
      "keywords": [
        "GPA"
      ],
      "links": [],
      "related_functions": []
    },
    {
      "name": "Справочники",
      "summary": "Справочники Меню справочники предназначен для ввода данных отправляемых в административные отчеты МОН РК (23...",
      "description": "Справочники\nМеню справочники предназначен для ввода данных отправляемых в административные отчеты МОН РК (23 формы). В системе Универ предусмотрен вариант интеграции с сайтом ЕВПО, за счет этого данные, вводимые в систему, автоматически отправляются на сайт министерства .",
      "steps": [],
      "keywords": [],
      "links": [],
      "related_functions": []
    },
    {
      "name": "Отчет Kaspi",
      "summary": "Отчет Kaspi Функционал предназначен для просмотра списка студентов, оплативших через приложение...",
      "description": "Отчет Kaspi\nФункционал предназначен для просмотра списка студентов, оплативших через приложение Kaspi. Если студент при  оплате через приложение Kaspi, выберет вид платежа  КазНУ им. Аль-Фараби. Оплата по ИИН, то его фамилию попадет в Отчет Kaspi в системе Универ.\nНажмите на функционал Отчет Kaspi, в открывшемся окне есть два вида поиска. Поиск по ИИН студента и по дате транзакции. Ниже в таблице вы можете увидет ИИН студента (Код студента), ФИО, Факультет, номер курса, Описание услуги, сумму, номер транзакции и дату транзакции. Нажавь на кнопку Сохранить отчет в формате Excel, вы можете сохранить отчет .",
      "steps": [
        "Отчет kaspi",
        "Нажмите на функционал отчет kaspi, в открывшемся окне есть два вида поиска"
      ],
      "keywords": [
        "оплата",
        "отчет",
        "поиск",
        "студент"
      ],
      "links": [],
      "related_functions": []
    },
    {
      "name": "Отчет по задолжникам по оплате",
      "summary": "Сформированный отчет показывает факультет, ФИО студента, специальность, курс, ступень обучения, отделение, и виды долгов...",
      "description": "Отчет по задолжникам по оплате.\nСформированный отчет показывает факультет, ФИО студента, специальность, курс, ступень обучения, отделение, и виды долгов .",
      "steps": [
        "Отчет по задолжникам по оплате"
      ],
      "keywords": [
        "отчет"
      ],
      "links": [],
      "related_functions": []
    }
  ]
}