{
  "metadata": {
    "file_name": "Методический отдел",
    "section_title": "Модуль Методический отдел",
    "source_type": "university_documentation",
    "last_updated": "2025-05-12",
    "language": "ru",
    "document_version": "1.0",
    "doc_id": "metodicheskiy_otdel",
    "tags": [
      "методический отдел",
      "УМКД",
      "каталоги",
      "силлабус",
      "проверка"
    ],
    "audience": "staff_only",
    "restricted": true
  },
  "section": "Модуль Методический отдел",
  "description": "Модуль предназначен для проверки УМКД, формирования отчетов, и работы со справочниками.",
  "roles": [
    "преподаватель",
    "сотрудник методического отдела"
  ],
  "functions": [
    {
      "name": "УМКД (Архив)",
      "description": "– функция предназначена для хранения силлабусов.\n\nДля просмотра списка УМКД, размещенных в архиве, нужно выполнить следующие действия:\nвыбрать УМКД (Архив) . На экране появится список дисциплин;\nдважды щелкнуть на дисциплине для просмотра загруженных файлов;\nдважды щелкнуть для просмотра или сохранения файла .",
      "links": [],
      "keywords": [
        "архив",
        "умкд"
      ]
    },
    {
      "name": "УМКД преподавателей",
      "description": "– эта функция позволяет контролировать загрузку УМКД преподавателями по преподаваемым дисциплинам.\n\nПосле загрузки преподавателями УМКД в программу, сотрудники методического отдела осуществляют проверку УМКД.\nДля проверки УМКД преподавателей необходимо выполнить следующие действия:\nвыбрать функцию «УМКД преподавателей»;\nвыбрать в новом окне факультет и кафедру и выбрать команду «Поиск преподавателя»;\nна экране появится список преподавателей заданной кафедры ;\nнажать «Просмотр УМКД преподавателя» или дважды щелкните на фамилии преподавателя;откроется список дисциплин преподавателя. Напротив каждой дисциплины будет высвечиваться информация о количестве загруженных файлов ;для просмотра списка файлов УМКД нужно дважды щелкнуть на дисциплину. На экране появится список файлов. Каждый файл будет содержать информацию: тип файла, размер, когда был загружен, сколько раз скачали файл. Для просмотра содержимого файла нужно дважды щелкнуть на него. Тогда программа будет предлагать открыть файл на экране для просмотра или сохранить в файл.",
      "links": [],
      "keywords": [
        "поиск",
        "файл",
        "просмотр",
        "сохранить",
        "умкд"
      ]
    },
    {
      "name": "Структуры УМКД",
      "description": "– функция предназначена для определения сотрудниками методического отдела количества загружаемых УМКД, по тому или иному типу УМКД.\n\nДля каждого типа занятия (лекция, семинар и т.д.) можно установить типы УМКД, которые нужно загружать, а которые загружать не обязательно . Например, для преподавателя по лекции можно установить, что необходимо обязательно загрузить 1 файл УМКД типа Силлабус, а файлы типа Лабораторная загружать не нужно.\n – Структура УМКД\nВарианты типов загрузки:\nОбязательно – файлы должны быть загружены.\nНе обязательно – файлы могут быть загружены, но их наличие не обязательно.\nНе загружать – файлы данного типа не должны загружаться по данному типу занятия.\nТакже можно установить минимально необходимое количество файлов и максимальное количество файлов. Если эти значения равны 0, то количество файлов не регулируется.\nСтруктура УМКД задается на учебный год. Для навигации используются кнопки :\n – Переход по годам обучения",
      "links": [],
      "keywords": [
        "силлабус",
        "файл",
        "умкд"
      ]
    },
    {
      "name": "Интерактивный силлабус",
      "description": "преподавателей (Статистика)\nДля просмотра интерактивного силлабуса преподавателя:\nвыбрать функцию интерактивный силлабус преподавателей (статистика);\nв открывшемся окне необходимо выбрать факультет/кафедру и нажать на «Поиск преподавателя»\n – поиск преподавателя\nв нижней части выйдет список преподавателей по выбранным критериям. Далее для просмотра статистики интерактивного силлабуса преподавателя выберите перподавателя и нажмите на «Просмотр»откроется окно где можно посмотреть статус интерактивного силлабуса",
      "links": [],
      "keywords": [
        "силлабус",
        "поиск",
        "просмотр"
      ]
    },
    {
      "name": "Каталоги",
      "description": "– функция предназначена для работы со справочниками, которые имеют отношение непосредственно к методическому отделу.\n\n(ступени обучения, формы обучения, типы УМКД, специальности, специализации, УМКД преподавателей, УМКД).\nДля работы со справочниками выберите нужный справочник, например:специальности. Откроется окно со списком специальностей. Для того, чтобы произвести действие с той или иной специальностью, щелкните на специальность и выберите одну из предложенных команд (Редактировать, Удалить). Для добавления новой специальности, выберите команду «Добавить». На экране появится форма, которую нужно заполнить  и активизировать команду «Добавить».Справочник - Типы УМКД.\nДля добавления нового типа УМКД в справочник нужно выполнить следующие действия:\nвыбрать из меню Типы УМКД;\nна экране появится список типов УМКД ;\n – Типы УМКД\nвыбрать команду «Добавить»;\nввести название типа УМКД на трех языках, выбрать тип файла, который можно загружать . Если поставить галочку в окошко – «Любой», то тип файла при загрузке УМКД не будет контролироваться. Если отмечены другие файлы, то есть возможность загружать только файлы данного типа. Здесь же можно поставить отметку о том, что загружать можно без привязки к дисциплине и выбрать функцию «При удалении помещать в архив;\nвыбрать команду «Сохранить».\n – Добавление типа УМКД\nДля редактирования типов УМКД нужно выбрать тип УМКД из списка и активизировать команду Редактировать. После внесения изменений выбрать команду «Сохранить».",
      "links": [],
      "keywords": [
        "справочник",
        "архив",
        "сохранить",
        "умкд",
        "добавить"
      ]
    },
    {
      "name": "Каталог дисциплин",
      "description": "– Модуль  «Методический отдел»\n\nДля добавления или редактирования дисциплин необходимо:\nво вкладке метод отдел выбрать «каталог дисциплин»\nв открывшемся окне для поиска можно внести ID дисциплины, либо название. Если указанной в поиске дисциплины нету, либо для внесения новой дисциплины нажмите на «Добавить»\nв открывшемся окне запонните название и описание дисциплины на 3-х языках.Укажите Тип/статус. Если по данной дисциплине студент может претендовать с оценкой 4 на ГОС экзамене то быбираете да либо нет.\nНажмите на «Сохранить»",
      "links": [],
      "keywords": [
        "каталог",
        "добавить",
        "сохранить"
      ]
    }
  ]
}